{
    "descriptions":[
      "This is an assignment I completed for my intro to interdisciplinary honors class. This assignment was a reflection on our college decision making process and our aspirations for the future.", 
      "This is an assignment I completed for my intro to interdisciplinary honors class. This assignment involved an interview with a peer to discover their interests. Then we were suppose to explain three learning projects that fit their interests and the honors program for experiential learning. My partner was Emily and I recommended that she join a mathematics research team, study abroad, or join the Dream Project for her two experiential learning projects. ",
      "This is an assignment I completed for my intro to interdisciplinary honors class. This assignment involved planning out all the courses we were going to take during our four years here. I choose to plan my schedule around a biology major and Spanish minor, even though I am completely undecided in terms of my major. ",
      "This was a summer job that I had for several through high school and into college. I was a swim instructor, primarily for the three and four year old class and a lifeguard at a local pool in my hometown.",    
      "This was a job that I had during the majority of my time at UW. I began as a Evening Maintenance Assistant, where I was tasked with checking class room technology like projectors, control systems, and monitoring and basic troubleshooting. After nearly a year I was promoted to the Lead Student Supervisor where I was tasked with supervising the shift of students who were tasked with checking and troubleshooting technology. I was also tasked with more advanced troubleshooting skills. In my final year in this job, I stepped back and focused on our website worked mostly with web development.",      
      "This was a summer job I had at Paradise Inn in Mt. Rainier National Park. Paradise is a somewhat remote popular tourist area on Mt. Rainier. I primarily worked as a barista in the inn. During this time, I lived in an employee dorm that was located essentially at the trailhead of many of trails at Paradise so I easy access hiking and camping and spent a lot of in my free time exploring the park. ",      
      "This was a nine month internship with Puget Sound Energy. During this internship, I was on a performance analytics team within the IT department. During this internship, I was tasked with building the monthly IT dashboard. I had the opportunity to complete projects, including scorecard documentation, presentations about collaboration tools, and communications documentation.", 
      "Over the summer, I spent three weeks walking El Camino de Santiago Compostela. El Camino is a historical pilgrimage, that has regained popularity in recent years. The trail ends in Santiago de Compostela, a town in north western Spain where St. James is supposedly buried. There are many different routes to Santiago, but we took the Camino Frances, a route through northern Spain. During my time on the trail, I walked over 300 kms, from Leon, through Santiago, and then continued on to Fisterra, on the coast. During this time I stayed in hostels in anywhere from large cities Leon to small villages.",
      "This was a website that our group created for our intro Informatics class. This website was a resource that allowed people to redistribute children's books to place in need of books. The hope was that this would boost children's literacy.",
      "This was the first essay that I wrote in my intro to philosophy class. I took this class at the beginning of my sophomore year on college. The paper was on physicalism, idealism, and dualism, or different world views.",
      "This was one of the essays that I wrote for a honors class called 'What We Know and How We Know It'. In the class we were doing a unit on history and so we wrote this paper on the historical accuracy of some media. I wrote my essay on an episode of Doctor Who that depicts Madame de Pompadour.",
      "This was one of the lab reports I wrote in my second class in the intro chemistry series. This lab report is on weak acid titrations.",
      "This was one of the first programs I wrote in the introductory programming classes. This program compares two applicants and determines the best one in Java.",
      "This was an essay that I wrote an intro to philosophical topics in law class. In this class we explored how key legal decisions were made in American history. This paper explores how the Dred Scott case was decided.",
      "This was an assignment that I did for my Transformational Technologies for Biology, Medicine, and Health class. The task was to parsed the text in a couple hundred redacted medical records and identify and combine all the diagnoses in these medical records and create a table with the count of each diagnosis. "
    ]
}