{
    "reflections":[
      "As first this assignment felt like a longer version of the same conversation I have had with teachers, grandparents, and friends for the past few months. I am going to UW. This is why. It was not until I got to the part where I had to explain what I wanted to do with my time here at UW that I got stuck. What did I want to do with my time here? I got to college- that was the goal, wasn't it? What was I going to do with my time here? So, I wrote down a few things about study abroad and Peace Corps, and turned the assignment in. But really, I did not know what I was going to with my time here. It seemed as though my opportunities had suddenly opened up. All the possible paths that I could potentially take were all overwhelming. Ultimately, it was this assignment that initially got me to consider all the paths I could take.", 
      "One of the biggest benefits I found in this project was the time I spent looking into specific study abroad opportunities for Emily. The time I spent looking into study abroad for her allowed me to discover some opportunities that I would be interested in. I learned that it was possible to fulfill some Honors credits as well additional requirements through a study abroad. In a large part due to this assignment, I am considering taking part in a summer study abroad during my time here.",
      "This assignment went smoothly enough at first, I picked some classes that were required in my major, minor, and some honor classes. The trick was trying to fit all these classes into four years. After playing with my schedule for a bit, I got the classes where I wanted them. Then I ran an audit. A rather lengthy list of unfulfilled requirements popped up. I needed a diversity class? What was a diversity class? After spending more time fiddling with my schedule, I eventually managed to make a schedule that fulfilled all the requirements. I knew going into college that it was hard to graduate in four years. However, it was not until I tried completing all the credits I needed to graduate into four years, that I realized how hard it is. People tell you that you have time to decide on your major. They tell you that there is time to take some general interest classes. But after completing this assignment, I realized that this is only partially true. Sure, I have a year or two before I have to know what my major is, but during that year or two, I have to complete the requirements I need to get into my major. I have to be deliberately taking classes that fulfill general requirements needed to graduate. I have time to take classes I want, but I have to ensure that at the same time, they are fulfilling requirements. This assignment only shows how much every class matters.",
      "As my first job, I learned a lot during my time at BGCC. One important thing I learned was about being assertive. The BGCC pool had many rules, more rules than most pools. As a lifeguard I had to enforce those rules, which often times meant telling people no and standing my ground. It was hard, especially the first summer. I found that I have a tendency to want to tell people yes, which I obviously could not do. However, many of the swimmers we talked to were kids and were younger than me, so it was not too hard, but telling adults they could not do this or that was difficult. I admit, I am not a naturally assertive person and this job did not magically turn me into one. But I learned a lot about learning when to step in and intervene in a situation. I learned how to say politely no and explain why. I learned how to manage less-than-happy people while maintaining my ground. However, assertiveness is something I still struggle with and something I know I need to work on, especially in unfamiliar situations. But I think this job gave me the foundation that I needed to know how to politely assert myself when needed. This job taught me a lot about people. A lifeguard is primarily paid to people-watch and at a small country club, with a small membership, it was interesting to watch families interact and grow up over the years. I learned a lot about parenting styles- perhaps too much. I find that I now have strong opinions about parenting even though I do not have any kids. But as a lifeguard and swim instructor, exposed to hundreds of different families over the years, it is easy to identify patterns. A part of learning about people is learning about class differences. Naturally at a country club, there are those people who are wealthy. I grew up in a middle-class neighborhood and was surrounded by mostly middle-class friends. While there were certainly some differences between the middle-class people I grew up with and the wealthier people that at the pool, many of the families that I regularly saw were those who honestly just wanted a place where their kids could swim and not have to worry about them drowning. The regulars at the pool usually were more concerned with their kids than any demonstration of money. ",    
      "During my years at Classroom Technology and Events, I learned a lot about management and leadership. I was given a lot of responsibility regarding the training new student employees and management of the evening preventative management shifts. I learned a lot about how to keeping people on the same page. I was surprised as the difficulty of management and I gained some appreciation for managers and the balancing of the needs of the organization and the needs of employees and adapting when plans don't go to plan. As a result of my time here, I discovered that I enjoyed for organizing and keeping things together. I enjoy having a variety of things to do. I also learned a lot about A/V hardware and web development. This furthered my own interest in technology outside the classroom. Another skill I developed during this time was public speaking. I was responsible for leading a daily meeting and training new employees. Over time I learned how to speak concisely and effectively with little preparation in front of a dozen employees. I have realize that my speaking skills that I have developed here have helped me in classes when I have had to do presentations. Through this job, I also gained confidence in leading and problem-solving under pressure. There were times in this job there I had to identify and fix a problem with A/V hardware in front a of a lecture hall of students. I have had to learn how to take charge of situation where I am not confident, and I do not initially know the answer. As a result of my time at CTE, I have been able to develop essential life and professional skills including leadership, management, speaking skills and problem-solving. I have developed my own interests in management and organizing, and confirmed my own interest in technology. ",      
      "I learned a lot about community and the characteristics of a strong community during my time on that mountain. There were about sixty other employees that lived up at Paradise that summer and from my first day there was a sense of community that I have found in very few other places. This was in part due to the location, the size of the population, and the limited access to the outside friends, family, and information. Sixty people stranded on a mountain with little access to cell phones, internet, or entertainment will bond surprisingly quickly. But I also think this sense of community was formed in part due to shared struggles. Living in such a confined environment, everyone was forced to go through many of the same struggles. When the water got shut off and we had to struggle through several hours of serving guests with no water, this impacted everyone at Paradise from the kitchen staff who had to cook and clean with no water, to the front desk employees who had to communicate with unhappy guests, to the cafe staff who had to run a cafe without most of their drinks. At the end of the day, we all had experienced the same struggle and frustration and this gave us something to talk about and share. In larger environments, such unique experiences and struggles are rarely experienced universally across the population and people are unable to bond in the same way. There is power in shared struggles and a smaller environment in building community. Going forward, I am more aware of struggles' impact on a community and how common experiences can have a powerful impact on a group of people. ",      
      "During my time at Puget Sound Energy, I learned a lot about the difference between working in a professional environment, especially in large organizations, and an academic environment. I realized that in the academic world, we create things in vacuums. Our projects tend to have very few stakeholders, we have clear expectations, and we have all the resources and skills needed to complete projects. However, in large organizations, this is not necessarily the case. I found that the large number of stakeholders and vague expectations and were particularly challenging. During my time at PSE, I found that the building or creating new projects were largely dependent on outside stakeholders and resources. Ultimately, unlike a more academic environment, it takes advocacy and buy in to get stuff done. I, as a particularly quiet person, found this difficult. I found that while the technical knowledge and other soft skills I had going into this internship were useful and important, the ability to navigate large organizations, talk to stranger, and advocate for oneself was much more important to success than anything else. I also had to try to learn how to communicate effectively with people with extremely different backgrounds goals than myself. In school, there are plenty of people with diverse backgrounds, however, we all have a similar knowledge base and approaches to solving problems because we all have similar academic backgrounds and have likely taken the same classes. However, in the workplace, backgrounds vary much more. There is a lot more diversity in how people solve problems and the skills they have to solve problems, which complicates group projects. I had to learn about approaches I didn't necessarily understand. I had to learn about the importance of advocating/selling for one's own ideas. In the academic world, I often had complete control over my project, or in the case of a group project, at least some control. However, in the case of the professional world, especially the large company where I worked, I found that I had little control over some of the projects I was tasked with completing. If I felt that something could be improved, I had to advocate/sell my idea to whoever had the control. As a person who is not particularly skilled at selling things, this was difficult for me. I realized that this is a weakness of mine that I need to improve. I also learned to adapt my expectations around project completion time and control. If it takes a week to schedule a meeting with each of the stakeholders, then a project is going to take a bit of time. ", 
      "There were many key things that I learned from this trail. The first, I suppose, is the power of breaking big things apart and consistently tackling those bits one at a time. On the trail, we walked over 300 kms. And we did that, not by doing as much as we could everyday, But we did as much as we could while still being able to get up the next morning. Sometimes this meant putting forward only 80% a day. After finishing this trail and looking back on the distance I had walked, I realized that there is a difference between giving one hundred percent in a day and one hundred percent over time. It's not hard to give 100% in a day- but it takes strategy to put forward 100% over time. Ultimately this changed the way I thought about my schoolwork. For a long time I was that procrastinating student that did panic marathons of essay writing/exam studying/debugging the night before the thing was due. I found that after this trail, I could better appreciate the slow putting together of assignments and essays rather than the last minute procrastination. Although working on something only to put it down only partly completed after an hour or two for several nights in a row feels less productive than an eight hour marathon the night before a thing was due, ultimately it is the better strategy. When I approach my schoolwork this way the quality of my assignments is better and I don't feel exhausted like I am giving 100% everyday.",
      "This class was a major reason why I decided to apply to the informatics major. I really admired how this class, and informatics in general, was self-aware and made efforts to see beyond the technical components of applications. This project gave us the opportunity to think through various problems, potential solutions, and their impact. Perhaps it's the philosophy part of me, but I enjoyed exploring not only the applications themselves, but also how they interacted with the world.",
      "This class was a major reason why I decided to become a philosophy major. I found that I enjoyed thinking about different world views and exploring reasons why they could or could not be possible. I discovered that there were other people who enjoyed thinking about these issues are well. ",
      "This was one of the first essays that I wrote in college and I remember feeling out of my depth as I wrote it. I did not feel like I was prepared to write historical analysis' or knew enough to analyze historical depictions. I ended up making claims that I could not support well nor made much sense. I struggled with this paper, and I remember recognizing  the importance of making small supportable claims rather than large unsupportable ones. Being one of my first papers in college, I also struggled at first with the openness of the prompt. This paper had a particularly wide range of potential topics and for a while I struggled with that. On the other hand, I also liked the fact that we were allowed to organize our essay as we liked. After high school, where our essays had follow a rather strict set of guidelines and expectations, it was freeing to be able to write and organization my thoughts how I thought it would be best to organize them.",
      "I have always been a big believer in hard work. I struggled with this lab report, and in the intro to chemistry series in general, but I believed that if I worked hard enough, I would not only learn the material, but I would also learn to like chemistry. A couple quarters in the chemistry series, and not only was I still struggling with the class, but I didn't like chemistry anymore than when I started. I ended up reevaluating why I was taking the class and I didn't have a good reason beyond that chemistry seemed like a good strong class. I was struggling over something that I wasn't really benefiting from. I eventually ended up dropping the class. What I took away from this experience is that while hard work is essential, it can't make up for a lack of interest in the subject. I learned that there's a lot of value in pursuing things that I truly have an interest in, rather than things I want to have an interest in. ",
      "I truly enjoyed this class. This was one of the first classes where really didn't mind spending hours working on it. After taking this class, I knew I wanted to pursue some major that involved programming and how I ended up finding informatics. ",
      "holder text",
      "One of the things that I learned through this assignment, it the difficulty of parsing free text, yet, we learned in class that there is usefulness of free text- (more efficient, include relevant details, what doctors are used to etc. It would be possible to create Electronic Medical records that are perfectly computer-parsable. These records could make research around medicine much easier because computer can find patterns. But a perfectly computer-parsable electron medical record is not necessarily what is best for doctors and patients. There is some trade off between the benefits of creating an electronic medical record that is easily parsable and not parsable. This project is useful to my professional career because in the data science world is all about parsing data and there are a lot of data contained in free form text. The ability to  this data with some level of competency could open up a lot more data for analysis, and therefore open a lot more potential conclusion/results. It was also this project that made me realize how difficult relationship between technology and the medical world. In the medical world, change is taken slowly because any mistakes or even less than perfectly optimal technology can have catastrophic results in a person's life. However, the technology world approaches the world completely differently. Technology takes a fast-paced approach to the world. Companies will push working code and make it better later. Technology is all about innovating and changing things. This creates a tension between these two world, and I found that it's not necessarily a tension that I want to work in. ",
      "This was a unique class for many reasons, but one of the most obvious reasons is that this class didn't take place in a classroom. There weren't any true lectures or assignments during this nine day period. Rather, the class happened organically out in a national park. One thing I found interesting about this class was comparing how much I felt like I learned outside of the classroom setting versus in the typical classroom setting. I found that outside of the classroom setting, I felt like I wasn't absorbing information at the same rate as I did in the classroom. One possible reason why I felt like this is possibly because the learning was spread out over the course of a day rather in one or two hour lectures. So it's entirely possible that I retained a larger rate of the information given to us, but it didn't feel like I had because the information wasn't fed to us at the same pace and so I wasn't absorbing information at the pace as in a lecture. Another possibility is that after spreading years in classrooms, that something about a classroom triggers something that signals that it's time to focus and absorb information. I noticed that out in nature that I didn't dial in and focus in the same that I would in the classroom. But perhaps more importantly, while I may or may not have retained the same amount of information outside of the classroom, it never really felt like a class in same way a class in a classroom felt. By that I mean, that this class was fun. I wanted to be there. There were hard parts, sure, but overall, it didn't feel like a chore like attending class often feels like a chore. "
    ]
}