{
    "reflections":[
      "As first this assignment felt like a longer version of the same conversation I have had with teachers, grandparents, and friends for the past few months. I am going to UW. This is why. It was not until I got to the part where I had to explain what I wanted to do with my time here at UW that I got stuck. What did I want to do with my time here? I got to college- that was the goal, wasn't it? What was I going to do with my time here? So, I wrote down a few things about study abroad and Peace Corps, and turned the assignment in. But really, I did not know what I was going to with my time here. It seemed as though my opportunities had suddenly opened up. All the possible paths that I could potentially take were all overwhelming. Ultimately, it was this assignment that initially got me to consider all the paths I could take.", 
      "One of the biggest benefits I found in this project was the time I spent looking into specific study abroad opportunities for Emily. The time I spent looking into study abroad for her allowed me to discover some opportunities that I would be interested in. I learned that it was possible to fulfill some Honors credits as well additional requirements through a study abroad. In a large part due to this assignment, I am considering taking part in a summer study abroad during my time here.",
      "This assignment went smoothly enough at first, I picked some classes that were required in my major, minor, and some honor classes. The trick was trying to fit all these classes into four years. After playing with my schedule for a bit, I got the classes where I wanted them. Then I ran an audit. A rather lengthy list of unfulfilled requirements popped up. I needed a diversity class? What was a diversity class? After spending more time fiddling with my schedule, I eventually managed to make a schedule that fulfilled all the requirements. I knew going into college that it was hard to graduate in four years. However, it was not until I tried completing all the credits I needed to graduate into four years, that I realized how hard it is. People tell you that you have time to decide on your major. They tell you that there is time to take some general interest classes. But after completing this assignment, I realized that this is only partially true. Sure, I have a year or two before I have to know what my major is, but during that year or two, I have to complete the requirements I need to get into my major. I have to be deliberately taking classes that fulfill general requirements needed to graduate. I have time to take classes I want, but I have to ensure that at the same time, they are fulfilling requirements. This assignment only shows how much every class matters.",
      "As my first job, I learned a lot during my time at BGCC. One important thing I learned was about being assertive. The BGCC pool had many rules, more rules than most pools. As a lifeguard I had to enforce those rules, which often times meant telling people no and standing my ground. It was hard, especially the first summer. I found that I have a tendency to want to tell people yes, which I obviously could not do. However, many of the swimmers we talked to were kids and were younger than me, so it was not too hard, but telling adults they could not do this or that was difficult. I admit, I am not a naturally assertive person and this job did not magically turn me into one. But I learned a lot about learning when to step in and intervene in a situation. I learned how to say politely no and explain why. I learned how to manage less-than-happy people while maintaining my ground. However, assertiveness is something I still struggle with and something I know I need to work on, especially in unfamiliar situations. But I think this job gave me the foundation that I needed to know how to politely assert myself when needed. This job taught me a lot about people. A lifeguard is primarily paid to people-watch and at a small country club, with a small membership, it was interesting to watch families interact and grow up over the years. I learned a lot about parenting styles- perhaps too much. I find that I now have strong opinions about parenting even though I do not have any kids. But as a lifeguard and swim instructor, exposed to hundreds of different families over the years, it is easy to identify patterns. A part of learning about people is learning about class differences. Naturally at a country club, there are those people who are wealthy. I grew up in a middle-class neighborhood and was surrounded by mostly middle-class friends. While there were certainly some differences between the middle-class people I grew up with and the wealthier people that at the pool, many of the families that I regularly saw were those who honestly just wanted a place where their kids could swim and not have to worry about them drowning. The regulars at the pool usually were more concerned with their kids than any demonstration of money. ",    
      "During my years at Classroom Technology and Events, I learned a lot about management and leadership. I was given a lot of responsibility regarding the training new student employees and management of the evening preventative management shifts. I learned a lot about how to keeping people on the same page. I was surprised as the difficulty of management and I gained some appreciation for managers and the balancing of the needs of the organization and the needs of employees and adapting when plans don't go to plan. As a result of my time here, I discovered that I enjoyed for organizing and keeping things together. I enjoy having a variety of things to do. I also learned a lot about A/V hardware and web development. This furthered my own interest in technology outside the classroom. Another skill I developed during this time was public speaking. I was responsible for leading a daily meeting and training new employees. Over time I learned how to speak concisely and effectively with little preparation in front of a dozen employees. I have realize that my speaking skills that I have developed here have helped me in classes when I have had to do presentations. Through this job, I also gained confidence in leading and problem-solving under pressure. There were times in this job there I had to identify and fix a problem with A/V hardware in front a of a lecture hall of students. I have had to learn how to take charge of situation where I am not confident, and I do not initially know the answer. As a result of my time at CTE, I have been able to develop essential life and professional skills including leadership, management, speaking skills and problem-solving. I have developed my own interests in management and organizing, and confirmed my own interest in technology. ",      
      "I learned a lot about community and the characteristics of a strong community during my time on that mountain. There were about sixty other employees that lived up at Paradise that summer and from my first day there was a sense of community that I have found in very few other places. This was in part due to the location, the size of the population, and the limited access to the outside friends, family, and information. Sixty people stranded on a mountain with little access to cell phones, internet, or entertainment will bond surprisingly quickly. But I also think this sense of community was formed in part due to shared struggles. Living in such a confined environment, everyone was forced to go through many of the same struggles. When the water got shut off and we had to struggle through several hours of serving guests with no water, this impacted everyone at Paradise from the kitchen staff who had to cook and clean with no water, to the front desk employees who had to communicate with unhappy guests, to the cafe staff who had to run a cafe without most of their drinks. At the end of the day, we all had experienced the same struggle and frustration and this gave us something to talk about and share. In larger environments, such unique experiences and struggles are rarely experienced universally across the population and people are unable to bond in the same way. There is power in shared struggles and a smaller environment in building community. Going forward, I am more aware of struggles' impact on a community and how common experiences can have a powerful impact on a group of people. ",      
      "During my time at Puget Sound Energy, I learned a lot about the difference between working in a professional environment, especially in large organizations, and an academic environment. I realized that in the academic world, we create things in vacuums. Our projects tend to have very few stakeholders, we have clear expectations, and we have all the resources and skills needed to complete projects. However, in large organizations, this is not necessarily the case. I found that the large number of stakeholders and vague expectations and were particularly challenging. During my time at PSE, I found that the building or creating new projects were largely dependent on outside stakeholders and resources. Ultimately, unlike a more academic environment, it takes advocacy and buy in to get stuff done. I, as a particularly quiet person, found this difficult. I found that while the technical knowledge and other soft skills I had going into this internship were useful and important, the ability to navigate large organizations, talk to stranger, and advocate for oneself was much more important to success than anything else. I also had to try to learn how to communicate effectively with people with extremely different backgrounds goals than myself. In school, there are plenty of people with diverse backgrounds, however, we all have a similar knowledge base and approaches to solving problems because we all have similar academic backgrounds and have likely taken the same classes. However, in the workplace, backgrounds vary much more. There is a lot more diversity in how people solve problems and the skills they have to solve problems, which complicates group projects. I had to learn about approaches I didn't necessarily understand. I had to learn about the importance of advocating/selling for one's own ideas. In the academic world, I often had complete control over my project, or in the case of a group project, at least some control. However, in the case of the professional world, especially the large company where I worked, I found that I had little control over some of the projects I was tasked with completing. If I felt that something could be improved, I had to advocate/sell my idea to whoever had the control. As a person who is not particularly skilled at selling things, this was difficult for me. I realized that this is a weakness of mine that I need to improve. I also learned to adapt my expectations around project completion time and control. If it takes a week to schedule a meeting with each of the stakeholders, then a project is going to take a bit of time. ", 
      "There were many key things that I learned from this trail. The first, I suppose, is the power of breaking big things apart and consistently tackling those bits one at a time. On the trail, we walked over 300 kms. And we did that, not by doing as much as we could everyday, But we did as much as we could while still being able to get up the next morning. Sometimes this meant putting forward only 80% a day. After finishing this trail and looking back on the distance I had walked, I realized that there is a difference between giving one hundred percent in a day and one hundred percent over time. It's not hard to give 100% in a day- but it takes strategy to put forward 100% over time. Ultimately this changed the way I thought about my schoolwork. For a long time I was that procrastinating student that did panic marathons of essay writing/exam studying/debugging the night before the thing was due. I found that after this trail, I could better appreciate the slow putting together of assignments and essays rather than the last minute procrastination. Although working on something only to put it down only partly completed after an hour or two for several nights in a row feels less productive than an eight hour marathon the night before a thing was due, ultimately it is the better strategy. When I approach my schoolwork this way the quality of my assignments is better and I don't feel exhausted like I am giving 100% everyday."
    ]
}